export const state = () => ({
  apiUrl: 'http://127.0.0.1:8000',
  appUrl: 'http://localhost:3000',
  material: [
        [
            'Ұстаздарға материалдар, ашық сабақтар, сабақ жоспарлары',
            'ашық сабақтар, сабақ жоспарлары, тәрбие сағаттары, қысқа мерзімді жоспар, орта мерзімді жоспар, олимпиада сұрақтар, қмж, омж, сабақтар',
            'Мұғалімдерге ашық сабақтар, сабақ жоспарлары, тәрбие сағаттары, омж, қмж құжаттарды тегін жүктеп сабақта қолдануға болады. Ашық сабақтар сайты',
            '/material'
        ],
        [
            'Тегін ашық сабақтар, сабақ жоспарлары, қысқа мерзімді жоспарлар',
            'ашық сабақ, сабақ жоспарлар, жоспар, сабақтар, қмж, омж, ұжм, олимпиада жауаптары, тест сұрақтары, аттестация, мұғалімге',
            'Мұғалімдерге ашық сабақтар, сабақ жоспарлары, қысқа мерзімді жоспарлар, тест сұрақтары, қмж, омж, сабақ жоспарларының үлгілерін тегін жүктеп алыңыз',
            '/material/tegin'
        ],
        [
            'Педагогтарға арналған сабақтар мен жоспарлар, қысқа мерзімді жоспарлар',
            'педагогтарға, тест жауаптары ашық сабақ, сабақ жоспарлар, жоспар, сабақтар, қмж, омж, ұжм, олимпиада жауаптары, тест сұрақтары, аттестация, мұғалімге',
            'Педагогтарға арналған ашық сабақтар мен жоспарлар жинаған ұстаз тілегі сайтынан жүктеп алып, өз сабағыңызда қолданыңыз. Сайтта 300 000 астам ашық сабақтар жарияланған',
            '/material/payd'
        ],
        [
            '«Ustaz tilegi» Республикалық ғылыми – әдістемелік журналы',
            'журнал, жинақ, жинаққа материал жариялау, тегін сертификат, жинақтарды көру, ұстаз тілегі журналы, журналға жазылу, журнал сертификаты',
            '«Ustaz tilegi» Республикалық ғылыми – әдістемелік журналы министірліктің №KZ09VPY00029937 куәлігімен ресми тіркелген. Журнал министірлікте тіркелгендіктен сертификат аттестацияға жарамды',
            '/zhurnal'
        ],
        [
            'ҚМЖ, қысқа мерзімді сабақ жоспарлары',
            'қмж, қысқа мерзімді сабақ жоспарлары, 472 бұйрықпен жазылған қмж, қысқа мерзімді жоспар, 472 бұйрық үлгісі, қмж үлгісі, қмж жүктеу, краткосрочный план урока, Поурочные планы, қмж тегін жүктеу',
            'ҚМЖ, 472 бұйрық бойынша жазылған дайын Қысқа мерзімді сабақ жоспарларын осы беттен жүктеп алып сабақ барысында қолдана аласыз. ҚР білім және Ғылым министірлігінің стандарты бойынша жазылған',
            '/qmg'
        ],

    ]
})

// const cors = require('cors');
// const corsOptions ={
//     origin:'http://localhost:3000',
//     credentials:true,            //access-control-allow-credentials:true
//     optionSuccessStatus:200
// }
// app.use(cors(corsOptions));
